Revit 2027 API
IntersectionResult.EdgeObject Property
Edge of the face close to the point of intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Edge EdgeObject { get; }
Public ReadOnly Property EdgeObject As Edge
	Get
public:
property Edge^ EdgeObject {
	Edge^ get ();
}
member EdgeObject : Edge with get
Property Value
Edge
Exceptions
Exception | Condition
InvalidOperationException |  Thrown in the getter when this property has not been set by the method providing the result.
See Also
Reference
IntersectionResult Class
Autodesk.Revit.DB Namespace